import React from "react";
import ErrorBox from "../components/ErrorBox";
import SimpleModal from "../components/SimpleModal";
import AdvancedModal from "../components/AdvancedModal";
import Form from "../components/Form";
import validateNationalCode from "../utils/nationalCodeVerify";
import CarPlate from "../components/CarPlate";

interface CarPlateData {
  firstSegment: string;
  secondSegment: string;
  thirdSegment: string;
  fourthSegment: string;
}

const Home = () => {
  const handleAdvancedModal = () => {
    console.log("Advanced Modal approved");
  };
  const handleSimpleModal = () => {
    console.log("Simple Modal clicked");
  };
  const handleCarPlate = (data: CarPlateData) => {
    console.log("car plate data: ", data);
  };
  return (
    <>
      {/* <ErrorBox msg="هیچ موردی یافت نشد." /> */}
      <div className="flex flex-row gap-3">
        <SimpleModal
          title={"عنوان مدال"}
          description={
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
          }
          buttonTitle={"مدال ساده"}
          innerButtonTitle={"عنوان دکمه"}
          theme={"warning"}
          onClick={handleSimpleModal}
        />
        <AdvancedModal
          title={"عنوان مدال پیشرفته"}
          description={
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
          }
          buttonTitle={"مدال پیشرفته"}
          approveButton={"تایید"}
          theme={"success"}
          onApprove={handleAdvancedModal}
        />
        <CarPlate onSubmit={handleCarPlate} />
      </div>
      <div className="w-1/2"></div>
      <Form />
      {/* {console.log(validateNationalCode("7731689951"))} */}
    </>
  );
};
export default Home;
